local Language = {}

Language = {
	--BY_EnterRoomManager 进入房间
	[1] = "กำลังเข้าสนาม...",--[1] = "正在进入场...",
	[2] = "กำลังสร้างห้อง...",--[2] = "创建房间中...",
	[3] = "สร้างห้องเก็บคะแนนล้มเหลว...",--[3] = "创建积分房失败...",
	[4] = "กำลังนั่งลง...",--[4] = "正在坐下...",
	[5] = "กำลังเข้าห้อง...",--[5] = "正在进入房间...",
	[6] = "คุณออนไลน์สะสมครบ 3ชั่วโมงแล้ว ผู้เล่นกรุณาพักสักหน่อย เพื่อสุขภาพของท่าน หลังจากผู้เล่นกรอกข้อมูลปลดล็อคนี้แล้วจะสามารถเล่นได้ต่อ กด“ตกลง”เพื่อดำเนินการกรอกข้อมูล",--[6] = "您累计在线时间已满3小时，请您下线休息，做适当身体活动。您可以在补填防沉迷信息后继续游戏，点击“确定”进行补填。",

	--BY_Extend 大厅
	[20] = "เกมยิงปลาหรรษา:เลขห้อง",--[20] = "亲朋捕鱼大乱斗:房号",
	[21] = "เลขห้อง:",--[21] = "亲友房号:",
	[22] = " ระยะเวลาแข่งขัน：",--[22] = " 比赛时长：",
	[23] = " สะสมคะแนน:",--[23] = " 基础积分:",
	[24] = " จำนวนคนปัจจุบัน:",--[24] = " 当前人数:",

	--BY_GameRedPacket 红包
	[30] = "เริ่มกิจกรรมอั่งเป่าฤดูร้อนสุขสันต์ VIP≥5หรือผู้เล่นที่สำเร็จภารกิจเติมเงินได้รับแพ็คเกจมือใหม่แล้ว จะได้รับ\"อั่งเป่าฤดูร้อน\"3ครั้ง อาจจะได้รับ<color=#C23D05FF>อั่งเป่าวีแชท ชิป รางวัลบัตรของขวัญ</color>！เริ่มวันที่ 23 มิถุนายน！",--[30] = "清凉夏日红包活动开启。VIP≥5级或充值领取了新手礼包的玩家完成任务即可领取3次“夏日红包”,可能获得<color=#C23D05FF>微信红包、金币、手游礼票奖励</color>！6月23日激情开启！",
	[31] = "ตกลง",--[31] = "确定",
	[32] = "ยินดีด้วยผู้เล่นได้รับ：",--[32] = "恭喜玩家获得：",
	[33] = "รางวัลจะถูกส่งไปที่จดหมาย กรุณาไปเช็คจดหมายที่หน้าล็อบบี้หลัก",--[33] = "奖励通过邮箱发放，请在大厅邮件中查看。",
	[34] = "อั่งเปาได้โอนส่งแล้ว ไม่ต้องรับ กรุณาตรวจสอบที่กระเป๋าเงินวีแชท",--[34] = "红包转账发放，无需领取，请在微信零钱中查看。",
	[35] = "ไม่ทราบ",--[35] = "未知",
	[36] = "ได้รับข้อมูลรางวัลกิจกรรมล้มเหลว",--[36] = "获取活动奖励数据失败",
	[37] = "การเข้าถึง Webเซิร์ฟเวอร์ล้มเหลว",--[37] = "访问web服务器失败",
	[38] = "กำลังรับรางวัลกิจกรรม...",--[38] = "正在获取活动奖励...",

	--BY_GameProp 鱼雷
	[50] = "กรุณารอหอกตรีศูลเสร็จสมบูรณ์ค่อยใช้ระเบิดตอร์ปิโด", --"请等待三叉戟结算完成再使用鱼雷"
	[51] = "ระเบิดตอร์ปิโดไม่เพียงพอ การฆ่าปลาที่ใช้ระเบิดตอร์ปิโดจะมีโอกาสน้อยลง", --"鱼雷数量不足，捕获携带鱼雷的鱼有几率掉落"
	[52] = "ตกลงต้องการใช้“ปุ่มปล่อยทั้งหมด”ที่มีอยู่ในตัวคุณ<color=#E1661CFF>ระเบิดตอร์ปิโดทั้งหมด</color>？", --"是否确认使用“一键释放”释放您身上的<color=#E1661CFF>所有鱼雷</color>？"
	[53] = "ยิงระเบิดตอร์ปิโดล้มเหลว จำนวนระเบิดตอร์ปิโดไม่เพียงพอ",
	[54] = "ระเบิดตอร์ปิโด", --"鱼雷"
	[55] = "ปุ่มปล่อย", --"一键释放"

	--BY_GameTrident 三叉戟
	[70] = "ตอนนี้ชิปไม่เพียง",
	[71] = "ตอนนี้หอกตรีศูลพลังงานยังไม่เต็ม",
	[72] = "กรุณารอระเบิดตอร์ปิโดเสร็จสมบูรณ์ค่อยใช้หอกตรีศูล", --请等待鱼雷结算完成再使用三叉戟
	[73] = "กรุณารอหอกตรีศูลเสร็จสมบูรณ์ค่อยใช้หอกตรีศูล", --"请等待三叉戟结算完成再使用三叉戟"
	[74] = "รายได้หอกตรีศูล",--"三叉戟收益",
	[75] = "กฏเกมหอกตรีศูล",
	[76] = "<color=#BD3C02FF>รูปแบบเกม:</color>ฆ่าปลาชนิดใดก็ได้ จะสามารถเพิ่มพลังให้กับหอกตรีศูล",
	[77] = "คะแนนของปลายิ่งสูงจะยิ่งเติมพลังได้เร็วขึ้น หลังจากเติมพลังให้หอกตรีศูลเต็มแล้ว คุณสามารถเลือกลงเดิมพันเพื่อมาใช้หอกตรีศูล เพื่อเพิ่มโอกาสที่จะได้รับชิปที่มากขึ้น แต่ว่าก็ชิปที่ลงเดิมพันไปก็อาจจะแพ้ได้เช่นกันนะ",
	[78] = "VIP ≥  <color=#BD3C02FF>%d</color>  สามารถสะสมพลังงานของหอกตรีศูลได้ %d หลอด",

	--BY_BatteryManager 炮台
	[90] = "กระสุนฟรีใช้หมดแล้ว การจับสองเท่าปิดใช้งานชั่วขณะ", --"免费子弹不足，暂时关闭双倍捕获"
	[91] = "กระสุนของคุณหมดแล้ว กรุณารอสรุปผลการแข่งขัน",
	[92] = "คะแนนสะสมไม่เพียงพอที่จะใช้อัตราจ่ายกระสุนดังกล่าว ระบบจะเปลี่ยนอัตราจ่ายของอาวุธให้อัตโนมัติ",--[92] = "积分不足以发射当前倍率子弹，自动切换武器倍率",
	[93] = "ชิปไม่เพียงพอที่จะใช้อัตราจ่ายกระสุนดังกล่าว ต้องการไปที่ร้านค้าซื้อชิปเพิ่มหรือไม่？",
	[94] = "ได้รับข้อมูลปืนใหญ่ล้มเหลว กรุณาลองเข้าห้องใหม่อีกครั้ง",

	--BY_GameScratchCard
	[110] = "ฟรี",

	--BY_AwardBox
	[130] = "สวมใส่",--"穿戴"
	[131] = "%dK",
	[132] = "ตกลง", --"确 定"
	[133] = "ยกเลิก", --"取 消"
	--BY_AwardRecord奖励记录
	[150] = "กำลังดาวโหลด",
	[151] = "ดาวโหลดข้อมูลบันทึกรางวับใหญ่เกินเวลาที่กำหนด",
	[152] = "อัตราจ่ายของปืนใหญ่ที่ใช้ยิ่งสูง จะได้รับรางวัลมากขึ้น บันทึกรางวัลใหญ่แสดงล่าสุด 50รายการ", --使用的炮台倍数越高，获得的奖金越高，显示最近50条大奖记录
	[153] = "เวลา", --"时间"
	[154] = "ชื่อ", --"昵称"
	[155] = "รางวัลแจ็คพอต", --"奖池"
	[156] = "รางวัลโบนัส", --"奖金"
	--BY_GamblingView 下注
	[170] = "สูง", --"大"
	[171] = "ต่ำ", --"小"
	[172] = "ต้องการลงเดิพันชิป%d เดา%s", --"是否投入金币%d,猜%s"
	[173] = "ชิปไม่เพียงพอ ไม่สามารถเข้าร่วมเกมแทงสูงต่ำตานี้ได้",

	--BY_GameView 
	[190] = "เชื่อมต่ออินเตอร์เน็ตไม่ได้ หลุดออกจากเซิร์ฟเวอร์ \nกรุณาล็อคอินเข้าใหม่",
	[191] = "กำลังเข้าสู่สนามชิป...",
	[192] = "ชิปของคุณไม่เพียงพอสำหรับการเข้าห้องนี้!",
	[193] = "ชิปของคุณไม่เพียงพอสำหรับการเข้าห้องนี้ จะเข้าสนามชิปเลือกหน้าอินเตอร์เฟซหรือไม่?",
	[194] = "ชิปที่ห้องทดลองใช้ได้แค่ในห้องทดลองเท่านั้น ไม่สามารถนำชิปออกไปห้องอื่นได้",
	[195] = "กดคลิก“<size=32><color=#FF0000FF>รีเซ็ต</color></size>”แล้ว，จะทำการรีเซ็ตค่าทั้งหมดในห้องทดลองของคุณแล้วเริ่มนับใหม่ ชิปทดลองรีเซ็ตเป็น<size=32><color=#FF0000FF>1ร้อยล้าน</color></size>",
	[196] = "รีเซ็ต",
	[197] = "ยกเลิก",--取消
	[198] = "รีเซ็ตชิปทดลอง",
	[199] = "หลังจากออกจากเมกแล้ว ต้องการเก็บรักษาไว้คงเดิมหรือไม่？".."\n".."ถ้าเลือก<color=#FF0000FF>【ไม่เก็บ】</color> จะทำการรีเซ็ตค่าทั้งหมดในห้องทดลองเป็น<color=#FF0000FF>ค่าเริ่มต้น</color>",
	[200] = "เก็บรักษา",
	[201] = "ไม่เก็บ",
	[202] = "ไปทันที", --"立即前往"
	[203] = "โหมดสะสมคะแนนไม่สามารถออกระหว่างเกมได้",
	[204] = " เริ่มใช้งานฟังก์ชั่นนี้",--"开启此功能",
	[205] = "ต้องการไปที่ Super World Cup หรือไม่？",--[205] = "是否跳转至超级世界杯？",
	[206] = "หลังเปิดใช้งานฟังก์ชั่น จะใช้ชิปเพิ่มเป็นสองเท่า แต่ก็จะได้รับชิปในอัตราสองเท่าเช่นกัน",--"开启该功能后，将消耗双倍金币，同时获得双倍捕获率",
	[207] = "หลังเปิดใช้งานฟังก์ชั่น กดคลิกปลาบนหน้าจอ จะสามารถล็อคเป้าหมายแล้วโจมตีได้ต่อเนื่อง",--"开启该功能后，点击屏幕上的鱼，可以锁定并持续攻击该目标",
	[208] = "กำลังรวบรวมข้อมูลเซิร์ฟเวอร์...",--"正在同步服务器数据...",
	[209] = "ได้รับข้อมูล Super World Cupล้มเหลว",--"获取超级世界杯数据失败",
	[210] = "กำลังดำเนินการ Super World Cup...",--"正在进入超级世界杯...",
	[211] = "ชิปไม่เพียงพอ ไม่สามารถเปิดใช้ระบบยิงออโต้ได้",--"金币不足，无法开启自动攻击",
	[212] = "เริ่มใช้ระบบยิงออโต้",--"开启自动射击",
	[213] = "หลังจากคลิกที่ปลาจะสามารถล็อคเป้าหมายได้",--"点击鱼之后可以锁定目标",
	[214] = "ชิปไม่เพียงพอ ไม่สามารถเริ่มใช้ฟังก์ชั่นนี้ได้",--"金币不足，无法开启该技能",
	[215] = "ใช้ชิปเพิ่มสองเท่า จะยิงกระสุนออกสองลูก",--"消耗双倍金币，发射两颗子弹",
	[216] = "กระสุนเจาะสามารถยิงทะลุปลาทั้งหมดเป็นแนวเส้นตรงได้",--"穿透子弹可以打中一条直线上的所有鱼",
	[217] = "ได้รับข้อมูลเซิร์ฟเวอร์เกมล้มเหลว กรุณาลองล็อคอินใหม่",--"获取游戏服数据失败，请重新登录",
	[218] = "อยู่ในเกมไม่สามารถซื้อโทรโข่งได้ กรุณาย้อนกลับล็อบบี้ไปที่ร้านค้าเพื่อทำการซื้อ",--"游戏内无法购买喇叭，请返回大厅商城购买",
	[219] = "เนื่องจากไม่ได้ดำเนินการนานเกินไป จึงหลุดจากเซิร์ฟเวอร์ \nกรุณาลองล็อคอินใหม่",--"由于长时间未操作，与服务器断开连接，\n请重新登录",
	[220] = "เชื่อมต่อล้มเหลว กรุณาเข้าห้องใหม่อีกครั้ง",	--连接失败，请重新入场
	[221] = "การคูณเพิ่มแพ็คแข่งขันหมดอายุ ต้องการไปซื้อหรือไม่?";--竞技礼包加成已失效，是否前往购买
	[269] = "เท่า",--"倍数",
	[277] = "ภาพรางวัล",--"中奖组合",
	--BY_JinBiView
	[291] = "ชิปของคุณไม่เพียงพอสำหรับการเข้าห้องนี้！",--"您的金币不足以进入该场，是否进入商店兑换？",
	[292] = "หลุดการเชื่อมต่อจากเซิร์ฟเวอร์ ไม่สามารถเข้าห้องได้",--"与服务器断开连接，无法进入房间",
	[293] = "วันนี้จำนวนการเล่นทดลองใช้หมดแล้ว พรุ่งนี้ค่อยมาใหม่นะ",--"今天体验次数已用完，请明天再来。",
	[294] = "วันนี้จำนวนคงเหลือ",--"今日剩余次数",
	[295] = "ระดับVIPคุณไม่เพียงพอที่จะเข้าห้องนี้",--您的VIP等级不足以进入该场
	--BY_LocationView
	[301] = "ตำแหน่งของคุณ",--"您的位置",

	[340] = "คำขอข้อมูลผิดพลาด",--"请求数据错误",
	[341] = "คำขอข้อมูล",--"请求数据",
	[360] = "เปิด",--"开",
	[361] = "ปิด",--"关",
	[362] = "เสียง",--"音效",
	[363] = "ดนตรี",--"音乐",
	[365] = "ตั้งค่าเกม",--"游戏设置",
	--BY_RankListView排行
	[380] = "เดือน",--"月",
	[381] = "วัน",--"日",
	[382] = "ตอนนี้ชนะต่อเนื่อง：",--"当前连胜：",
	[383] = "วันนี้ชนะต่อเนื่องสูงสุด：",--"今日最高连胜：",
	[384] = "ครั้ง",--"次",
	[385] = "<color=#FFE826FF>เวลารวม：ยังเหลือ%02dชั่วโมง%02dนาที%02dวินาที</color>",--"<color=#FFE826FF>统计时间：还有%02d小时%02d分钟%02d秒</color>",
	[386] = "วันที่19 เดือน12 - วันที่ 21 ผู้เล่นที่ชนะต่อเนื่องติดอันดับ5คนแรก ได้รับ<color=#FF0000FF>รางวัลคูณเท่า</color>",--"12月19日-21日连胜榜前5名的玩家,获得的<color=#FF0000FF>奖励翻倍</color>",
	[387] = "ทุกวันสรุปอันดับเวลา：วันถัดไป00:00น.",--"每日排名结算时间：次日00:00",
	--BY_RedPacketView 红包
	[400] = "เงื่อนไขยังไม่สำเร็จ",--"条件未达成",
	[401] = "ได้รับรางวัลแล้ว",--"奖励已领取",
	[402] = "VIP≥5หรือผู้เล่นที่เติมเงินและได้รับแพ็คเกจมือใหม่แล้วถึงจะได้รับรางวัลของกิจกรรมนี้ เกมที่ใช้ชิปเล่นสามารถอัพระดับVIPฟรีได้!",--"VIP≥5级或充值领取了新手礼包的玩家才可领取此活动奖励，玩金币类游戏可免费升级VIP！",
	[403] = "<color=#BA3D00FF>ได้รับ</color>",--"<color=#BA3D00FF>领取</color>",
	[404] = "<color=#373737FF>ได้รับแล้ว</color>",--"<color=#373737FF>已领取</color>",

	--BY_ScratchAllView
	[420] = "ใบที่ ",--[420] = "第 ",
	--BY_ScratchCardView
	[430] = "บัตรขูดฟรีไม่เพียงพอ ไม่สามารถแลกเปลี่ยนได้",--"免费刮刮卡数量不足，无法兑换",
	[431] = "ยืนยันจะใช้“แลกเปลี่ยนจำนวนมาก”โดยบัตรขูดฟรีของคุณจะถูกใช้ไป%dใบ（สูงสุดแลกได้50ใบ）？",--"是否确认使用“批量兑奖”消耗掉您身上%d张免费刮刮卡（最多可批量兑换50张）？。",
	[432] = "จำนวนบัตรขูดไม่เพียงพอ",--"刮刮卡数量不足",
	[433] = "%dวัน%dเดือน",--[433] = "%d月%d日",
	[434] = "บัตรขูดฟรีช่วงเวลาการดรอป：%s - %s",--"免费刮刮卡掉落时间：%s - %s",
	[435] = "บัตรขูดฟรีใช้ได้ถึง：ก่อน%s",--"免费刮刮卡使用期限：%s前",
	[436] = "จำนวนบัตรขูดฟรี：",--"免费刮刮卡数量：",
	[437] = "อธิบายวิธีเล่น：รางวัลชิปของบัตรขูดฟรี=ชิปxจำนวนคูณ จับได้ปลาชนิดใดก็ได้ก็มีอัตราการดรอปบัตรขูดฟรี สูงสุด",--"玩法说明：免费刮刮卡金币奖励数=金币区x倍数区，捕获任意鱼都有几率掉落免费刮刮卡。最高",
	[438] = "รางวัลคือ",--"奖励为",
	[439] = "<color=#BD3C02>แลกเปลี่ยน</color>",--"<color=#BD3C02>兑换</color>",
	[440] = "<color=#BD3C02>แลกเปลี่ยนจำนวนมาก</color>",--"<color=#BD3C02>批量兑换</color>",
	--BY_SettingView设置
	[460] = "หลังจากเปิดใช้งาน จะลดการใช้พลังงานน้อยลง แต่อาจจะส่งผลต่อการสัมผัสในขณะที่เล่นเกม<color=#FF9600>กรุณาใช้งานอย่างระมัดระวัง！</color>",
	        --"省电模式开启后，手机耗电量会减少，但可能会影响您的游戏手感。<color=#FF9600>请慎重开启！</color>",
	[461] = "เริ่มใช้",--"开启",
	--BY_ShopView
	[480] = "เติมเงินสำเร็จ！",--[480] = "充值成功！",
	[481] = "<color=#E1661CFF><size=33>%sคูปองพ้อยท์</size></color> แลกเปลี่ยน <color=#E1661CFF><size=33>%sชิป</size></color>?",--[481] = "<color=#E1661CFF><size=33>%s点券</size></color> 兑换 <color=#E1661CFF><size=33>%s金币</size></color>?",
	[482] = "กำลังแลกเปลี่ยน...",--[482] = "正在兑换中...",
	[483] = "แลกเปลี่ยนสำเร็จ！",--[483] = "兑换成功！",
	[484] = "แลกเปลี่ยนล้มเหลว！",--[484] = "兑换失败！",
	[485] = "เมื่อซื้อพ้อยท์จะแลกเปลี่ยนเป็นชิปให้อัตโนมัติ",--[485] = "购买点券时自动兑换金币",
	[486] = "ยืนยันแลกเปลี่ยน",--[486] = "确认兑换",
	[487] = "คูปองพ้อยท์",--[487] = "点券",
	[488] = "ชิป",--[488] = "金币",
	[489] = "แลกเปลี่ยนได้",--[489] = "可兑换",
	--BY_TridentBet投注
	[500] = "ชิปไม่เพียงพอ ไม่สามารถลงเดิมพันได้",--"金币不足,无法投该注",
	[501] = "<size=32>K</size>",--"<size=32>千</size>",没有万的概念改成千
	[502] = "จำนวนลงเดิมพัน: ",--"投入额度：",
	[503] = "ไม่ลง",--"不投入",
	[504] = "อัน\nดับ\nล่า\nสุด",--"当\n前\n排\n行",
	[505] = "จำนวนชนะต่อเรื่อง",--"连胜次数",
	[506] = "ชื่อ",--"昵称",
	[507] = "อันดับ1\n20ล้านชิป",--"第1名\n2000万金币",
	[508] = "อันดับ2\n10ล้าน\nชิป",--"第2名\n1000万\n金币",
	[509] = "อันดับ3-5\n3ล้าน\n金ชิป",--"第3-5名\n300万\n金币",
	[510] = "ขณะนี้ยังไม่มีผู้เล่นติดอันดับ",--"暂未有玩家上榜",
	[511] = "ปัจจุบันชนะต่อเนื่อง：0ครั้ง\nวันนี้ชนะต่อเนื่องสูงสุด：0ครั้ง",--"当前连胜：0次\n今日最高连胜：0次",
	[512] = "วันนี้ผู้เล่นที่ติดอันดับ5คนแรกจะได้รับรางวัลชิป ใช้หอกตรีศูลลงเดิมพันแบบครั้งเดียว 1ล้านชิปถึงจะนับแต้มชนะต่อเนื่อ",--"当天排行前5名的玩家可获得金币奖励。三叉戟单次投入100万才计入连胜。",
	[513] = "\nทุกวันอันดับจะสรุปเวลา：วันถัดไป 00:00\n<color=#FFE826FF>เวลาทั้งหมด：ยังเหลือ 13ชั่วโมง 44นาที 47วินาที</color>",--"\n每日排名结算时间：次日00:00\n<color=#FFE826FF>统计时间：还有13小时44分钟47秒</color>",
	[514] = "ผลงานของฉัน",--"我的成绩",
	[515] = "จัด\nอัน\nดับ",--"历\n史\n排\n行",
	[516] = "หลังจากลงเดิมพัน จะได้รับชิปแบบสุ่ม ขอให้คุณโชคดีนะ！",--"投入后，获得筹码是随机的，祝您好运哦！",
	[517] = "ห้องระดับยิ่งสูง ลงเดิมพันยิ่งสูง ห้องมืออาชีพลงเดิมพันได้สูงสุดถึง:2000k",
	--BY_WeaponView武器界面
	[521] = "VIP≥XX เริ่มใช้งานฟังก์ชั่นนี้",--"VIP≥XX，开启此功能",--"仅会员开启，充值任意点券即可获得会员。",
	[522] = "ไปเติมเงิน",--"前往充值",
	[523] = "x1เท่า~x100เท่า",--"x1倍~x100倍",
	[524] = "x10เท่า~x1kเท่า",--"x10倍~x1千倍",
	[525] = "x100เท่า~x10kเท่า",--"x100倍~x1万倍",
	[526] = "x1kเท่า~x20kเท่า",--"x1千倍~x2万倍",
	[527] = "x1เท่า~x20kเท่า",--"x1倍~x2万倍",
	[528] = "แจ้งเตือน\nระดับVIPปัจจุบันของคุณไม่ถึง ไม่สามารถได้รับปืนใหญ่นี้ \nใช้ชิปเล่นในเกม จะสามารถอัพระดับVIPได้",--"温馨提示\n您当前VIP等级不够，无法获得该炮台。\n游戏内消耗金币，可提升VIP等级",
	[529] = "<color=#FF0000FF>ชิปทดลองสามารถใช้ได้แค่ในห้องทดลองเล่นเท่านั้น！</color>",--"<color=#FF0000FF>体验金仅可在体验场使用！</color>",
	[530] = "ระดับ",--"级",
	[531] = "ถาวร",--"永久",
	[532] = "ปืนใหญ่นี้จะต้องเข้าถึง<color=red>ห้องระดับกลาง</color>เพื่อปลดล็อค",--"该炮台需到<color=red>中级场</color>解锁",
	[533] = "ปืนใหญ่นี้จะต้องเข้าถึง<color=red>ห้องระดับสูง</color>เพื่อปลดล็อค",--"该炮台需到<color=red>高级场</color>解锁",
	[534] = "ปืนใหญ่นี้จะต้องเข้าถึง<color=red>ห้องระดับมืออาชีพ</color>เพื่อปลดล็อค",--"该炮台需到<color=red>专家场</color>解锁",
	[535] = "คำขอข้อมูลปืนใหญ่",--"请求炮台数据",
	[536] = "คำขอข้อมูลปืนใหญ่เกินเวลา",--"请求炮台数据超时",
	[537] = "คำอธิบาย:ในเกมกดคลิกที่ปืนใหญ่ หน้าต่างนี้จะปรากฏขึ้นมา แล้วทำการเลือกปืนใหญ่ใหม่อีกครั้ง！",--"说明：游戏中点击炮台，可弹出本界面，重新选择大炮！",
	[538] = "กรุณาเลือกปืนใหม่",--"请选择大炮",
	[543] = "เกราะสีทอง",--"黄金甲",
	[544] = "VIPพิเศษ ทั้งตัวเป็นเกราะทองคำ",--"VIP专属，满身尽是黄金甲",
	[545] = "ได้รับปืนใหญ่",--"获得炮台",
	[546] = "VIP≥5",--"VIP≥5级",--"会员专属",
	[547] = "VIP≥18",--"VIP≥18",
	[548] = "VIPพิเศษระดับสูง  ทั้งตัวจะมีแต่กลิ่นอายของชนชั้นสูง",--"高级VIP专属，浑身散发着贵族气息",
	[549] = "x1เท่า~x10เท่า",--"x1倍~x10倍",
	[550] = "x10เท่า~x100เท่า",--"x10倍~x100倍",
	[551] = "พาลาดิน",--"圣骑",
	--BY_LoadingView
	[570] = "คำเตือน：จับปลาชนิดใดก็ได้จะสามารถเพิ่มพลังให้กับหอกตรีศูล ปลาที่มีแต้มยิ่งสูง พลังงานก็เริ่มยิ่งเร็วขึ้นนะ！",--"提示：捕获任意鱼都可以给三叉戟充能，分值越高的鱼，充能越快哦！",
	[571] = "กำลังพยายามดาวโหลด ไม่เสียอินเตอร์เน็ต...",--"努力加载中，不消耗流量...",

	--BY_JackpotExplain 百万巨奖
	[591] = "                รางวัล：อัตราคูณปืนใหญ่ <color=#DF6B28>X 300</color>      \nฆ่าปลาชนิดใดก็ได้ จะมีโอาสได้รับกระสุนฟรีและเข้าสู่ \nในระหว่างที่ใช้กระสุนฟรี จะมีโอกาสได้รับรางวัลแจ็คพอตนับล้าน \nใช้ปืนใหญ่ที่อัตราคูณยิ่งสูง จะได้รับชิปที่แจ็คพอตยิ่งมากขึ้น",
			--"                单人最高奖励可达      \n击杀任意鱼，一定几率获得免费子弹并进入\n使用免费子弹的过程中，一定几率释放百万奖池。\n使用炮台倍数越高，获得奖池的金币越多。",
	[592] = "                รางวัล：อัตราคูณปืนใหญ่ <color=#DF6B28>X 800</color>      \nฆ่าปลาชนิดใดก็ได้ จะมีโอาสได้รับกระสุนฟรีและเข้าสู่\nระหว่างที่ใช้กระสุนฟรี จะมีโอกาสได้รับรางวัลแจ็คพอตนับสิบล้าน \nใช้ปืนใหญ่ที่อัตราคูณยิ่งสูง จะได้รับชิปที่แจ็คพอตยิ่งมากขึ้น",
			--"                单人最高奖励可达      \n击杀任意鱼，一定几率获得免费子弹并进入\n使用免费子弹的过程中，一定几率释放千万奖池。\n使用炮台倍数越高，获得奖池的金币越多。",
	[593] = "                รางวัล：อัตราคูณปืนใหญ่ <color=#DF6B28>X 2999</color>      \nฆ่าปลาชนิดใดก็ได้ จะมีโอาสได้รับกระสุนฟรีและเข้าสู่\nระหว่างที่ใช้กระสุนฟรี จะมีโอกาสได้รับรางวัลแจ็คพอตนับร้อยล้าน \nใช้ปืนใหญ่ที่อัตราคูณยิ่งสูง จะได้รับชิปที่แจ็คพอตยิ่งมากขึ้น",
			--"                单人最高奖励可达      \n击杀任意鱼，一定几率获得免费子弹并进入\n使用免费子弹的过程中，一定几率释放亿万奖池。\n使用炮台倍数越高，获得奖池的金币越多。",	
	[594] = "กติการางวัลชิปแจ็คพอต",--"筹码奖池游戏规则",
	--BY_FirstPayView
	[610] = "ได้รับ",--"领 取",
	--BY_Extend
	[630] = "%02dวัน %02dชั่วโมง %02dนาที %02dวินาที",--"%02d天%02d时%02d分%02d秒",
	[631] = "%02dชั่วโมง %02dนาที %02dวินาที",--"%02d时%02d分%02d秒",
	--BY_GoldAward
	[640] = "เวลานับถอยหลัง:",--"倒计时:",
	[641] = "รางวัลถุงเงิน",--"小福袋奖金",

	--BY_ActivityExplain
	[680] = "กติกาจัดอันดับชนะต่อเนื่องของเกมเปิดแล้วรวย",--[680] = "翻翻翻连胜榜规则",
	[681] = "กติกากิจกรรม:",--[681] = "活动规则:",
	[682] = "1.ครั้งเดียว<color=#e1661c>ลงเดินพัน 1ล้าน</color>ที่หอกตรีศูลได้เข้าสู่เกมพลิกแล้วรวย ถึงจะได้บันทึกสถิติชนะต่อเนื่องสองเท่า \n2การชนะต่อเนื่องจะหยุดได้ต่อเมื่อเล่นแพ้เกมเพิ่มอัตราสองเท่า แต่หากออกเองหรือถึงจำนวนจำกัดการเพิ่มตราของหอกตรีศูล การชนะต่อเนื่องจะยังคงนับอยู่ \n3ผู้เล่นที่มีจำนวนชนะต่อเนื่องเท่ากัน จะนับจากเวลาเป็นตัวกรอง ผู้ที่ได้ก่อนจะอันดับสูงกว่า \n4ในแต่ละวันการจัดอันดับจะนำผลที่ดีที่สุดของผู้เล่น จำนวนชนะต่อเนื่องประจำวันจะถูกจัดอยู่อันดับประจำวัน",
	--[682] = "1.单次<color=#e1661c>投入 100 万</color>的三叉戟进入翻翻翻, 才会计入翻倍连胜。\n2.连胜只会在翻倍失败时中断, 主动退出或达到单个三叉戟翻倍次数上线退出, 不会中断连胜。\n3.连胜次数相同的玩家, 按达到次数时间排名, 先达到的排名靠前。\n4.排名会取玩家当天最好成绩, 当日连胜次数只参与当日排名。",
	[683] = "รางวัลกิจกรรม:",--[683] = "活动奖励:",
	[684] = "อันดับที่%s: ",--[684] = "第%s名: ",
	[685] = "%d",--[685] = "%d万",
	[686] = "วิธีรับรางวัล:",--[686] = "领奖方式:",
	[687] = "1.รางวัล5อันดับแรกการชนะต่อเนื่องของเกมเปิดแล้วรวย จะเด้งขึ้นภายในเกม \n2รางวัล<color=#e1661c>จะเก็บได้แค่3วัน</color> หากเกิน 3วันที่กำนด จะไม่สามารถรับรางวัลนี้ได้",
	--[687] = "1.翻翻翻连胜排行榜前5名金币奖励, 会在游戏内直接弹出。\n2.奖励<color=#e1661c>只保留3天</color>，若3天未上线领取，将无法获得该次奖励。",

	--BY_FishPay
	[690] = "วิธีซื้อ",--[690] = "购买方式",
	[691] = "Wechat",--[691] = "微信",
	[692] = "Alipay",--[692] = "支付宝",
	[693] = "สินค้า：",--[693] = "商品：",
	[694] = "ราคา：",--[694] = "价格：",
	[695] = "THB",--[695] = "元",

	--BY_GamblingView
	[700] = "สรุป",--[700] = "结算",
	[701] = "สูงสุดเพิ่มสองเท่าได้สำเร็จ2ครั้ง",--[701] = "最多可翻倍成功2次",
	--BY_MessageBox
	[709] = "แจ้งเตือน",--[709] = "温馨提示",
	[710] = "ตกลง",--[710] = "是",
	[711] = "ไม่",--[711] = "否",
	--BY_PrivateRecordView
	[712] = "เลขห้อง",--[712] = "房号",
	[713] = "ชื่อผู้เล่น",--[713] = "玩家昵称",
	[714] = "คะแนนผู้เล่น",--[714] = "玩家分数",
	[715] = "เวลาสรุปผล",--[715] = "结算时间",
	--BY_RedPacketView
	[716] = "วันที่ 23-24 มิถุนายน สำเร็จภารกิจที่เกี่ยวข้องจะได้รับทันที“<color=#FFEE33>อั่งเปา</color>”เมื่อเปิดจะสุ่มได้รับชิป บัตรของขวัญหรือ<color=#FFEE33>อั่งเปาเงินสดวีแชท</color>อย่างหนึ่ง！（VIP≥5หรือ<color=#FFEE33>เติมเงินได้รับแพคเก็จมือใหม่แล้ว</color>จะสามารถเข้าร่วมได้ VIPยิ่งสูง โอกาสได้รับรางวัลยิ่งมากขึ้น สิ้นสุดการรับรางวัล<color=#FFEE33>วันที่ 25 มิถุนายน เวลา 00.10น.</color>โดยจะส่งทางจดหมาย กรุณาตรวจสอบเพื่อรับรางวัล！）<color=#FFEE33>แต่ละภารกิจจะได้รับรางวัลเพียง 1ครั้ง</color>",
	--[716] = "6月23日-24日，完成对应任务即可领取“<color=#FFEE33>夏日红包</color>”，打开可随机获得金币、手游礼票或<color=#FFEE33>微信现金红包</color>任一种！（VIP≥5级或<color=#FFEE33>充值领取了新手礼包</color>的账号可参与，VIP等级越高，获大奖概率越高。奖励领取截止于<color=#FFEE33>6月25日0点10分</color>，并通过邮件发放，请注意查收！）<color=#FFEE33>每个任务只能领取1次奖励。</color>",
	[717] = "ชื่อ：",--[717] = "昵称：",
	[718] = "ระดับVIP：",--[718] = "VIP等级：",
	[719] = "只有已绑定服务号“<color=#FFEE33>亲朋游戏中心官网</color>”的账号才有概率获得<color=#FFEE33>微信现金红包</color>",
	--BY_ScratchAllView
	[720] = "ลำดับการ์ด",--[720] = "卡序列",
	[721] = "จุดจำนวนคูณ",--[721] = "倍数区",
	[722] = "จุดชิป",--[722] = "金币区",
	--BY_SlotMachineView
	[723] = "อื่นๆ",--[723] = "其他",
	[724] = "รางวัล=จำนวนคูณปืนใหญ่xจำนวนคูณของวงล้อ การ์ดตัวพิเศษสามารถแทนการ์ดอะไรก็ได้1ใบ",--[724] = "奖金=炮台倍数x转盘倍数，万能牌可代替任何1张牌",
	[725] = "จำนวนคูณ：",--[725] = "倍数：",

	[726] = "VIP≥1หรือซื้อแพ็คเกจยิงปลาจะปลดล็อคใช้งานหอกตรีศูลถาวร",--[726] = "VIP1≥1或购买捕鱼礼包可永久解锁三叉戟",
	[727] = "VIP≥1ปลดล็อคหอกตรีศูลถาวรทันที",--[727] = "VIP1≥1即可永久解锁三叉戟",
	[728] = "คลิกปลดล็อคหอกตรีศูล",--[728] = "点击解锁三叉戟",
	[729] = "ปลดล็อคทันที",--[729] = "立即解锁",
	[730] = "ปลดล็อคได้",--[730] = "即可解锁",
	[731] = "สำเร็จภารกิจยิงปลา ปลดล็อค%sเท่าปืนใหญ่",--[731] = "完成打鱼任务，解锁XX倍炮台",
	[732] = "กดปลดล็อค%sเท่าปืนใหญ่",--[732] = "点击解锁XX倍炮台",

	[733] = "ปืนใหญ่แพนด้า",--[733] = "五福熊猫炮",
	[734] = "เฉพาะVIPระดับสูง โชคใหญ่มาถึง มีสุขสบายใจ",--[734] = "高级VIP专属，五福临门，笑口常开",
	[735] = "แจ้งเตือน\nระดับVIPปัจจุบันของคุณไม่ถึง ไม่สามารถได้รับปืนใหญ่นี้ \nใช้ชิปเล่นในเกม จะสามารถอัพระดับVIPได้",--[735] = "温馨提示 \n 您当前VIP等级不够，无法获得该炮台。\n游戏内消耗金币，可提升VIP等级",

	[736] = "ยินดีด้วยปลดล็อคปืนใหญ่เบอร์%s อัตราคูณ%s",--[736] = "恭喜解锁X号炮台XX倍率",
	[737] = "ยินดีด้วยปลดล็อคปืนใหญ่เบอร์%s",--[737] = "恭喜解锁X号炮台",

	[738] = "ยินดีด้วยปลดล็อคปืนใหญ่เบอร์%s อัตราคูณ%s รางวัล%sชิป",--[738] = "恭喜解锁X号炮台XX倍率XX金币奖励",
	[739] = "ยินดีด้วยปลดล็อคปืนใหญ่เบอร์%s รางวัล%sชิป",--[739] = "恭喜解锁X号炮台XX金币奖励",
	
	[740] = "เลขเวอร์ชั่น: ",	--版本号
	[741] = "กำลังปิดปรับปรุง", --进场失败提示:  系统维护中
	[742] = " วินาที", --秒
	[743] = "เวลาคงเหลือในการยิง：",

	[744] = "สำเร็จภารกิจหรือ",
	[745] = "VIP≥1ปลดล็อค",

	[746] = "ปืนใหญ่ระดับ1", --"1级大炮"
	[747] = "ปืนใหญ่ระดับ2", --"2级大炮"
	[748] = "ปืนใหญ่ระดับ3", --"3级大炮"
	[749] = "ปืนใหญ่ระดับ4", --"4级大炮"
	[750] = "ปืนใหญ่ระดับ5", --"5级大炮"

	[751] = "ตั้งค่าการล็อคเป้า", --"锁定设置",
	[752] = "เลือกล็อคเป้าชนิดปลาได้ที่ตั้งค่าการล็อคเป้า <color=#2494CC>กดคลิก</color>", --"勾选锁定鱼种，设置锁定范围。<color=#2494CC>点击</color>",
	[753] = "                                                                     ถ้าเลือกล็อคเป้าชนิดปลาไว้แล้ว จะทำการยิงปลาที่เลือกไว้อัตโนมัติ ถ้าไม่เลือกปลาไว้เลย ก็จะต้องทำการยิงปลาด้วยตนเอง หลังจากเริ่มใช้ล็อคเป้าอัตโนมัติ สามารถกดเลือกปลาที่เป็นเป้าหมายอื่นได้",
	[754] = "เลือกทั้งหมด", --"全选",
	[755] = "ไม่เลือกทั้งหมด", --"全不选",

	[756] = "เพิ่มเท่าสำเร็จ", --成功 
	[757] = "เพิ่มเท่าไม่สำเร็จ", --失败

	[758] = "คืนมูลค่าทองก้อน:", --元宝价值返还
	[759] = "ระเบิด", --暴击
	[760] = "กำลังย้ายห้อง โปรดรอสักครู่",

	[761] = "ปืนใหญ่เรียกทรัพย์",
	[762] = "เอฟเฟคพิเศษอลังการ ชิปไหลมา",
	[763] = "\nวิธีได้รับปืนใหญ่",
	[764] = "กิจกรรมยังไม่เริ่ม กรุณาอดใจรอ!",

	[765] = "กติกากิจกรรม", --活动规则"
	[766] = "จับรางวัลวงล้อมังกรอยู่...", --龙转盘抽奖中...
	[767] = "กดหยุด:", --点击停止:

	[768] = "ซ่อนไว้",  --"隐藏",
	[769] = "แสดงผล", --"显示",

	[770] = "กำลังส่งคำขอข้อมูลอุปกรณ์วงล้อมังกรอยู่...",--请求神龙转轮道具信息中...
	[771] = "กำลังใช้งานอุปกรณ์วงล้อมังกร กรุณารอสักครู่",--龙转盘道具使用中，请稍后再试
	[772] = "กำลังจับรางวัลวงล้อเทพเจ้ามังกรอยู่...",--神龙转盘道具抽奖中...
	[773] = "คุณมีอุปกรณ์ที่ยังไมได้ใช้งาน ต้องการไปใช้งานหรือไม่？",--您有道具未使用，是否前去使用？
	[774] = "อุปกรณ์วงล้อมังกรไม่พอ กรุณษซื้อแพ็คเกจ",--龙转盘道具不足，请购买礼包
	[775] = "ไปใช้งานทันที",--前去使用
	[776] = "อุปกรณ์",

	[777] = "ปืนใหญ่มังกรไฟ",	--赤焰龙击炮
	[778] = "เอฟเฟกต์พิเศษ ปืนใหญ่มังกรไฟ",	--华丽专属特效，龙转盘专属炮台

	[779] = "ค่าโชคดี",		--幸运值
	[780] = "ใช้จ่าย",		--消耗
	[781] = "บัตรของขวัญ",	--礼票

	[782] = "สี่สัตว์เทพ-หงส์ไฟ",
	[783] = "การจุติเกิดใหม่ ยิงทำลายล้างรวดเร็ว,เป็นสัตว์เทพจากทิศทักษิณ",

	[784] = "อัพระดับล้มเหลวจะสะสมเข้าค่านำโชค หลังค่านำโชคเต็มจะได้รับรางวัล",

	[785] = "สี่สัตว์เทพ-พยัคฆ์ขาว",
	[786] = "ราชันย์แห่งสัตว์ร้าย แช่แข็งทุกสรรพสิ่ง การกลับมาของสัตว์เทพจากทิศประจิม",

	[787] = "ปืนใหญ่กระต่ายหยก",
	[788] = "กระต่ายหยกกลม ลมหนาวและเยือกเย็น",

	[789] = "ปืนใหญ่ปืนฉีดน้ำ",
	[790] = "พบกันที่ชายหาด ฤดูร้อนแสนสบาย",

	[791] = "分享",
	[792] = "神秘宝藏",
	[793] = "奖励记录",
    
	ExitGame = "ออกจากเกม",--退出游戏

	CommonWeaponConfig = {
		[1] = {
			ratio = {
				[1]='x1เท่า~10เท่า',
				[2]='x10เท่า~60เท่า',
			},
			description = {
				[1]='การใช้ชิป x1\nรางวัลชิป x1',
				[2]='การใช้ชิป x10\nรางวัลชิป x10',
			}
		},
		[2] = {
			ratio = {
				[2]='x10เท่า~100เท่า',
				[3]='x100เท่า~600เท่า',
			},
			description = {
				[2]='การใช้ชิป x10\nรางวัลชิป x10',
				[3]='การใช้ชิป x100\nรางวัลชิป x100',
			}
		},
		[3] = {
			ratio = {
				[3]='x100เท่า~1kเท่า',
				[4]='x1kเท่า~6kเท่า',
			},
			description = {
				[3]='การใช้ชิป x100\nรางวัลชิป x100',
				[4]='การใช้ชิป x1000\nรางวัลชิป x1000',
			}
		},
		[4] = {
			ratio = {
				[4]='x1kเท่า~10kเท่า',
				[5]='x10kเท่า~20kเท่า',
			},
			description = {
				[4]='การใช้ชิป x1000\nรางวัลชิป x1000',
				[5]='การใช้ชิป x10000\nรางวัลชิป x10000',
			}
		},
		[5] = {
			ratio = {
				[4]='x1kเท่า~10kเท่า',
				[5]='x10kเท่า~20kเท่า',
			},
			description = {
				[4]='การใช้ชิป x1000\nรางวัลชิป x1000',
				[5]='การใช้ชิป x10000\nรางวัลชิป x10000',
			}
		},
	},

	--服务器维护中 请稍后再试
	NetWorkError = 'เซิร์ฟเวอร์ปิดปรับปรุงอยู่ \n กรุณาทดลองใหม่ในภายหลัง',
	--多次点击，操作频繁
	moreClick = "บ่อยเกินไป",
	--每日充值礼包活动已结束
	giftEnd = "กิจกรรมเติมเงินแพ็คเกจรายวันสิ้นสุดแล้ว",
	--今日购买次数已用完，请于明日0点后再来哦
	noTime = "จำนวนการซื้อของวันนี้หมดแล้ว กรุณารอถึงวันพรุ่งนี้เวลา 00.00น.ค่อยซื้อใหม่นะคะ",

	awardPoolTitle = {
	[1] = "รางวัลนับล้าน",--"百万大奖",
	[2] = "รางวัลใหญ่สิบล้าน",--"千万巨奖",
	[3] = "รางวัลเศรษฐีร้อยล้าน",--"亿万豪奖",
	},

	--您当前可以进入刺激的更高级场次，是否立即前往
	JumpHighArenaText1 = "คุณปัจจุบันเข้าห้องระดับกลาง\nที่สนุกกว่าเดิมได้แล้ว และห้องระดับกลาง\nปลดล็อค\"ฉลามปรมาณู เทพเจ้ามังกรไฟ\"\nจะใช้<color=red>ระเบิดปรมาณูและวงล้อเทพเจ้ามังกร</color>ไฟได้\nต้องการไปเล่นหรือไม่？",
	JumpHighArenaText2 = "คุณปัจจุบันเข้าห้องระดับสูง\nที่สนุกเร้าใจกว่าเดิมได้แล้ว\nห้องระดับสูงจะปลดล็อค【<color=red>อัตราคูณที่สูงกว่า</color>】\nยิงปลาตายจะได้รับ【<color=red>ชิปมากมาย</color>】\nต้องการไปเล่นหรือไม่？",
	JumpHighArenaText3 = "คุณปัจจุบันเข้าห้องเทพเจ้าโชคลาภ\nที่สนุกเร้าใจกว่าเดิมได้แล้ว\nห้องนี้จะปลดล็อคเทพเจ้าโชคลาภ\nปลดปล่อย<color=red>พรจากฟ้า</color>！\nต้องการไปเล่นหรือไม่？",
	JumpHighArenaText4 = "คุณปัจจุบันเข้าห้องเจ้าสมุทร\nที่สนุกเร้าใจยิ่งกว่าเดิมได้แล้ว\nห้องเจ้าสมุทรจะปลดล็อค“บอสเจ้าสมุทร”\nมีโอกาสได้รับ<color=red>หอกตรีศูลเจ้าสมุทร</color>\nต้องการไปเล่นหรือไม่？",
	JumpHighArenaText5 = "คุณปัจจุบันเข้าห้องระดับเทพ\nที่สนุกเร้าใจยิ่งกว่าเดิมได้แล้ว\nห้องระดับเทพปลดล็อค【<color=red>อัตราคูณที่สูงกว่า</color>】\nยิงปลาตายได้รับชิปมากยิ่งขึ้น\nต้องการไปเล่นหรือไม่？",
	renderMode = {
		[1] = "ประหยัดพลังงาน", --"省电",
		[2] = "ราบรื่น", --"低帧",
		[3] = "สวยงาม", --"流畅",
		[4] = "เปิดเอฟเฟคทั้งหมด", --"华丽",
	},
	
	--BY_FishConfig
	bonusFishText = "ปลาโบนัส",

	noRecord = "ขณะนี้ไม่มีบันทึกได้รางวัล", --暂无得奖记录

	shareGame = "แชร์",

	arenaName = {
		[1] = "ห้องมือใหม่",
		[2] = "ห้องระดับกลาง",
		[3] = "ห้องระดับสูง",
		[4] = "ห้องระดับมืออาชีพ",
		[5] = "เจ้าสมุทรบุกโจมตี",
		[6] = "ห้องระดับเทพ",
	},

	DoubleErrTips = {
		[10019] = 'อุปกรณ์อื่นกำลังใช้อยู่ โปรดรอสักครู่',	--其他道具还在使用中，请稍后再试
		[10004] = 'ปัจจุบันชิปไม่พอ',	--当前筹码不足
	},
}

return Language